# running in memory/src/
read -sv memory.sv AnyConst.sv ResetCounter.sv
prep -top memory -nordff

hierarchy -smtcheck
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
