# running in gcdtest/src/
read -sv gcdtest.sv ResetCounter.sv
prep -top gcdtest -nordff

hierarchy -smtcheck
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
